Project/Toir/src/Reports/торо_СводнаяДиаграммаГрафиковППР/торо_СводнаяДиаграммаГрафиковППР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_СводнаяДиаграммаГрафиковППР</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_ПлановыеРемонтныеРаботы/торо_ПлановыеРемонтныеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ПлановыеРемонтныеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонтныхРабот</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>Отменен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_базы_расчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Замещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ID_замещающего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРасчетная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьРемонта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонтныхРабот</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ID_Корректировок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Catalogs/торо_ВидыРемонтов/торо_ВидыРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВидыРемонтов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПоУмолчанию</name>
      <description>По умолчанию</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидОбслуживанияОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланГрафикППР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрафикМероприятий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Непериодический</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ТипРабот</name>
    <type>
      <types>EnumRef.гкс_ТипыРабот</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/Reports/торо_СводнаяДиаграммаГрафиковППР/Forms/ФормаОтчета/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокВыбора(Элементы.ОтборПоВРВидСравнения.СписокВыбора);
	ЗаполнитьСписокВыбора(Элементы.ОтборПоОРВидСравнения.СписокВыбора);
	ЗаполнитьСписокВыбора(Элементы.ОтборПоОрганизацииВидСравнения.СписокВыбора);
	ОтборПоВРВидСравнения = ВидСравнения.Равно;
	ОтборПоОРВидСравнения = ВидСравнения.Равно;
	ОтборПоОрганизацииВидСравнения = ВидСравнения.Равно;
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019] 
	Элементы.ОрганизацияКонтрагент.СписокВыбора.Добавить(Справочники.Организации.ПустаяСсылка(), НСтр("es='La organización';ru='Организация';en='Organization'"));
	Элементы.ОрганизацияКонтрагент.СписокВыбора.Добавить(Справочники.Контрагенты.ПустаяСсылка(), НСтр("es='La contraparte';ru='Контрагент';en='Counterparty'"));
	//Элементы.ОрганизацияКонтрагент.СписокВыбора.Добавить(Справочники.Организации.ПустаяСсылка(), "Организация");
	//Элементы.ОрганизацияКонтрагент.СписокВыбора.Добавить(Справочники.Контрагенты.ПустаяСсылка(), "Контрагент");
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	ОрганизацияКонтрагент = Элементы.ОрганизацияКонтрагент.СписокВыбора[0].Значение;
	
	ОтборПоВРЗначение = Справочники.торо_ВидыРемонтов.ПустаяСсылка();
	ОтборПоОРЗначение = Справочники.торо_ОбъектыРемонта.ПустаяСсылка();
	ОтборПоОрганизацииЗначение = ОрганизацияКонтрагент;
		
	ДатаНач = НачалоГода(ТекущаяДата());
	ДатаКон = КонецГода(ТекущаяДата());
	
	ИерархияОР = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОсновнаяСтруктураИерархии",Истина);
	
	ЗаполнитьРеквизитыШапки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОтборПоОРПриИзменении(Элемент)
	Элементы.ОтборПоОРВидСравнения.Доступность = ОтборПоОР;
	Элементы.ОтборПоОРЗначение.Доступность = ОтборПоОР;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВРПриИзменении(Элемент)
	Элементы.ОтборПоВРВидСравнения.Доступность = ОтборПоВР;
	Элементы.ОтборПоВРЗначение.Доступность = ОтборПоВР;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	Элементы.ОтборПоОрганизацииВидСравнения.Доступность = ОтборПоОрганизации;
	Элементы.ОтборПоОрганизацииЗначение.Доступность = ОтборПоОрганизации;
	Элементы.ОрганизацияКонтрагент.Доступность = ОтборПоОрганизации;
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаОбработкаРасшифровки(Элемент, Расшифровки, СтандартнаяОбработка, Дата)
	Если ТипЗнч(Расшифровки) = Тип("Массив") Тогда
		
		СтандартнаяОбработка = Ложь;
		Расшифровка = Расшифровки[Расшифровки.Количество()-1];
		ПоказатьЗначение(Неопределено, Расшифровка.ДокументППР);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьИерархиюПриИзменении(Элемент)
	Элементы.ИерархияОР.Доступность = ОтображатьИерархию;
КонецПроцедуры

&НаКлиенте
Процедура ПолосаРегулированияДиаграммыГантаПриИзменении(Элемент)
	Если ПолосаРегулированияДиаграммыГанта < 1 Тогда
		Диаграмма.ПоддержкаМасштаба 				= ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	Иначе
		Диаграмма.ПоддержкаМасштаба 				= ПоддержкаМасштабаДиаграммыГанта.Период;
		Диаграмма.ЕдиницаПериодическогоВарианта 	= ТипЕдиницыШкалыВремени["День"];
		Диаграмма.КратностьПериодическогоВарианта 	= ПолосаРегулированияДиаграммыГанта;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОРВидСравненияПриИзменении(Элемент)
	
	Если ОтборПоОРВидСравнения = ВидСравнения.Равно ИЛИ ОтборПоОРВидСравнения = ВидСравнения.НеРавно Тогда
		Если ОтборПоОРЗначение = Неопределено Тогда
			
			ОтборПоОРЗначение = ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка");
			
		ИначеЕсли ТипЗнч(ОтборПоОРЗначение) = Тип("СписокЗначений") Тогда
			
			ОтборПоОРЗначение = ?(ОтборПоОРЗначение.Количество(),ОтборПоОРЗначение[0].Значение, ПредопределенноеЗначение("Справочник.торо_ОбъектыРемонта.ПустаяСсылка"));
			
		КонецЕсли;
	Иначе
		Если ОтборПоОРЗначение <> Тип("СписокЗначений") Тогда
			
			ОтборПоОРЗначение = Новый СписокЗначений;
			ОтборПоОРЗначение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ОбъектыРемонта");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоВРВидСравненияПриИзменении(Элемент)
	
	Если ОтборПоВРВидСравнения = ВидСравнения.Равно ИЛИ ОтборПоВРВидСравнения = ВидСравнения.НеРавно Тогда
		Если ОтборПоВРЗначение = Неопределено Тогда
			
			ОтборПоВРЗначение = ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка");
			
		ИначеЕсли ТипЗнч(ОтборПоВРЗначение) = Тип("СписокЗначений") Тогда
			
			ОтборПоВРЗначение = ?(ОтборПоВРЗначение.Количество(),ОтборПоВРЗначение[0].Значение, ПредопределенноеЗначение("Справочник.торо_ВидыРемонтов.ПустаяСсылка"));
			
		КонецЕсли;
	Иначе
		Если ОтборПоВРЗначение <> Тип("СписокЗначений") Тогда
			
			ОтборПоВРЗначение = Новый СписокЗначений;
			ОтборПоВРЗначение.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.торо_ВидыРемонтов");
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииВидСравненияПриИзменении(Элемент)
	
	Если ОтборПоОрганизацииВидСравнения = ВидСравнения.Равно ИЛИ ОтборПоОрганизацииВидСравнения = ВидСравнения.НеРавно Тогда
		Если ОтборПоОрганизацииЗначение = Неопределено Тогда
			
			ОтборПоОрганизацииЗначение = ОрганизацияКонтрагент; //ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
			
		ИначеЕсли ТипЗнч(ОтборПоОрганизацииЗначение) = Тип("СписокЗначений") Тогда
			
			ОтборПоОрганизацииЗначение = ?(ОтборПоОрганизацииЗначение.Количество(),ОтборПоОрганизацииЗначение[0].Значение, ОрганизацияКонтрагент)//ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
			
		КонецЕсли;
	Иначе
		Если ОтборПоОрганизацииЗначение <> Тип("СписокЗначений") Тогда
			
			ОтборПоОрганизацииЗначение = Новый СписокЗначений;
			ОтборПоОрганизацииЗначение.ТипЗначения = ?(ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации"), Новый ОписаниеТипов("СправочникСсылка.Организации"), Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВнешнимВидомФормы();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СортироватьПоОР(Команда)
	СортироватьПоОР = НЕ СортироватьПоОР;
	Элементы.СортироватьПоОР.Пометка = СортироватьПоОР;
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	Для каждого ТочкаДиаграммы Из Диаграмма.Точки Цикл
		Диаграмма.РазвернутьТочку(ТочкаДиаграммы, Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	Для каждого ТочкаДиаграммы Из Диаграмма.Точки Цикл
		Диаграмма.СвернутьТочку(ТочкаДиаграммы, Истина);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура Сформировать(Команда)
	
	Если НЕ ЗначениеЗаполнено(ДатаНач) ИЛИ НЕ ЗначениеЗаполнено(ДатаКон) Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("es='del informe!';ru='Не заполнен период отчета!';en='Report period is not filled!'"));
		Возврат;
		
	ИначеЕсли (ДатаНач > ДатаКон) или (ДатаНач <= Дата("10000101000000")) или (ДатаКон >= Дата("30000101000000")) Тогда
		
		ПоказатьПредупреждение(Неопределено, НСтр("es='Es incorrectamente establecido el período del informe, probablemente la fecha de la terminación menos de fechas ha comenzado, la fecha es más grande 3000 años o menos 1000.';ru='Неправильно установлен период отчета, возможно дата окончания меньше даты начала, дата больше 3000 года или меньше 1000.';en='The report period is incorrectly set, perhaps the end date is less than the start date, the date is more than 3000 years or less than 1000.'"));
		Возврат;
		
	ИначеЕсли ОтображатьИерархию И НЕ ЗначениеЗаполнено(ИерархияОР) Тогда 
		
		ПоказатьПредупреждение(Неопределено, НСтр("es='la representación.';ru='Не выбрана иерархия для отображения.';en='No hierarchy selected for display.'"));
		Возврат;
		
	КонецЕсли;
	
	ПараметрыПостроения = ПолучитьПараметрыПостроенияДиаграммыНаКлиенте();
	
	Диаграмма.Очистить();	
	СформироватьНаСервере(Диаграмма, Истина,,ПараметрыПостроения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьЗамещенные(Команда)
	ОтображатьЗамещенные = НЕ ОтображатьЗамещенные;
	Элементы.ФормаОтображатьЗамещенные.Пометка = ОтображатьЗамещенные;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакИзображение(Команда)
	
	Если Диаграмма.Точки.Количество() = 0 ИЛИ Диаграмма.Серии.Количество() = 0 Тогда
		ТекстСообщения = НСтр("es='Para la conservación del informe es necesario formarlo.';ru='Для сохранения отчета его необходимо сформировать.';en='To save the report, you need to generate it.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	Иначе
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.Фильтр = НСтр("es='El formato PNG (*.png) | *.png |';ru='Формат PNG (*.png)|*.png|';en='PNG format (* .png) | * .png |'")
		+ НСтр("es='El formato BMP (*.bmp) | *.bmp |';ru='Формат BMP (*.bmp)|*.bmp|';en='BMP format (* .bmp) | * .bmp |'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьКакИзображениеПослеВыбораФайла", ЭтотОбъект);
		ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКакИзображениеПослеВыбораФайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() > 0 Тогда
		
		ИмяФайла = ВыбранныеФайлы[0];
		
		Попытка
			Картинка = Диаграмма.ПолучитьКартинку(Элементы.Диаграмма.Ширина*15, Элементы.Диаграмма.Высота*15, ФорматКартинки[Прав(ИмяФайла,3)]);
			Картинка.Записать(ИмяФайла);
		Исключение
			ТекстСообщения = НСтр("es='¡No consiguió anotar el fichero!';ru='Не удалось записать файл!';en='Failed to write file!'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте
Процедура ПечатьДиаграммы(Команда)
	
	ПараметрыПостроения = ПолучитьПараметрыПостроенияДиаграммыНаКлиенте();
	ТабДок = ПолучитьТабличныйДокумент(ПараметрыПостроения);
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;
 
	ИдентификаторПечатнойФормы = "Сводная диаграмма графиков ППР";
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета = "Сводная диаграмма графиков ППР";
	ПечатнаяФорма.ТабличныйДокумент = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = "Сводная диаграмма графиков ППР";
 
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,,ЭтаФорма);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьПараметрыПостроенияДиаграммыНаКлиенте()
	
	СтруктураПараметров = Новый Структура(
		"ОтображатьИерархию,ИерархияОР,
		|ОтборПоОР,ОтборПоОРЗначение,ОтборПоОРВидСравнения,
		|ПодразделениеВладелец,ПодразделениеИсполнитель,
		|ОтборПоВР,ОтборПоВРЗначение,ОтборПоВРВидСравнения,
		|ОтборПоОрганизации,ОтборПоОрганизацииЗначение,ОтборПоОрганизацииВидСравнения,
		|ДатаНач,ДатаКон,
		|ОтображатьЗамещенные,СортироватьПоОР");
	
	ЗаполнитьЗначенияСвойств(СтруктураПараметров,ЭтаФорма);
	
	Возврат СтруктураПараметров;
	
КонецФункции

&НаСервере
Процедура СформироватьНаСервере(ЭлементВыводаДиаграммы, ДиаграммаДляОтчета, МакетОтчета = Неопределено, ПараметрыПостроения)
	
	// Заполнить параметры
	ОтображатьИерархию  		= ПараметрыПостроения.ОтображатьИерархию;
	ИерархияОР  				= ПараметрыПостроения.ИерархияОР;
	ОтборПоОР    				= ПараметрыПостроения.ОтборПоОР;
	ОтборПоОРЗначение     		= ПараметрыПостроения.ОтборПоОРЗначение;
	ОтборПоОРВидСравнения  		= ПараметрыПостроения.ОтборПоОРВидСравнения;
	ПодразделениеВладелец   	= ПараметрыПостроения.ПодразделениеВладелец;
	ПодразделениеИсполнитель    = ПараметрыПостроения.ПодразделениеИсполнитель;
	ОтборПоВР           		= ПараметрыПостроения.ОтборПоВР;
	ОтборПоВРЗначение   		= ПараметрыПостроения.ОтборПоВРЗначение;
	ОтборПоВРВидСравнения   	= ПараметрыПостроения.ОтборПоВРВидСравнения;
	ОтборПоОрганизации           		= ПараметрыПостроения.ОтборПоОрганизации;
	ОтборПоОрганизацииЗначение   		= ПараметрыПостроения.ОтборПоОрганизацииЗначение;
	ОтборПоОрганизацииВидСравнения   	= ПараметрыПостроения.ОтборПоОрганизацииВидСравнения;
	ДатаНач           			= ПараметрыПостроения.ДатаНач;
	ДатаКон      				= ПараметрыПостроения.ДатаКон;
	ОтображатьЗамещенные     	= ПараметрыПостроения.ОтображатьЗамещенные;
	СортироватьПоОР     		= ПараметрыПостроения.СортироватьПоОР;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблОбъектовРем.ОбъектРемонтныхРабот КАК ОбъектРемонтныхРабот,
	|	ТаблОбъектовРем.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	ТаблОбъектовРем.ДатаНачалаРемонтныхРабот КАК ДатаНач,
	|	ТаблОбъектовРем.ДатаОкончанияРемонтныхРабот КАК ДатаКон,
	|	ТаблОбъектовРем.Регистратор КАК ДокументППР,
	|	ТаблОбъектовРем.ID КАК ID,
	|	ТаблОбъектовРем.Замещен КАК Замещен,
	|	ТаблОбъектовРем.Отменен КАК Отменен,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаНачСт,
	|	ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0) КАК ДатаКонСт,
	|	ЛОЖЬ КАК ЗамещенСт,
	|	ЛОЖЬ КАК ЕстьВЗ,
	|	ЛОЖЬ КАК ЕстьДвиженияПоВЗ,
	|	ИСТИНА КАК ДоступенДляРедактирования,
	|	0 КАК НомерОР
	|ИЗ
	|	РегистрСведений.торо_ПлановыеРемонтныеРаботы.СрезПоследних(
	|			,
	|			ОбъектРемонтныхРабот В
	|				(ВЫБРАТЬ
	|					Спр.Ссылка
	|				ИЗ
	|					Справочник.торо_объектыРемонта КАК Спр)) КАК ТаблОбъектовРем
	|ГДЕ
	|	НЕ ТаблОбъектовРем.Отменен
	|	И ТаблОбъектовРем.ДатаНачалаРемонтныхРабот МЕЖДУ &ПолеВводаДатаНачала И &ПолеВводаДатаКонца
	|	И (&ПоказыватьЗамещенные
	|			ИЛИ НЕ ТаблОбъектовРем.Замещен) &&БлокОтборов
	|
	|УПОРЯДОЧИТЬ ПО
	|	&&БлокУпорядочиваний";
	
	БлокОтборов = "";
	Если ОтборПоОР Тогда
		Если ОтборПоОРЗначение <> Неопределено Тогда
			
			Если ОтборПоОРВидСравнения = ВидСравнения.Равно Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот = &ПолеВводаОбъектРемонта";			
			ИначеЕсли ОтборПоОРВидСравнения = ВидСравнения.НеРавно Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот <> &ПолеВводаОбъектРемонта";
			ИначеЕсли ОтборПоОРВидСравнения = ВидСравнения.ВСписке Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот В (&ПолеВводаОбъектРемонта)";
			ИначеЕсли ОтборПоОРВидСравнения = ВидСравнения.НеВСписке Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот НЕ В (&ПолеВводаОбъектРемонта)";
			ИначеЕсли ОтборПоОРВидСравнения = ВидСравнения.ВИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот В ИЕРАРХИИ (&ПолеВводаОбъектРемонта)";
			ИначеЕсли ОтборПоОРВидСравнения = ВидСравнения.НеВИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот НЕ В ИЕРАРХИИ (&ПолеВводаОбъектРемонта)";
			ИначеЕсли ОтборПоОРВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот В ИЕРАРХИИ (&ПолеВводаОбъектРемонта)";
			ИначеЕсли ОтборПоОРВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот НЕ В Иерархии (&ПолеВводаОбъектРемонта)";
			КонецЕсли;  
		Иначе
			БлокОтборов = БлокОтборов + " И	 
			|  ТаблОбъектовРем.ОбъектРемонтныхРабот = Значение(Справочник.торо_ОбъектыРемонта.ПустаяСсылка)"; 
		КонецЕсли;
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////
	Если Не ПодразделениеВладелец.Пустая() И ПодразделениеИсполнитель.Пустая() Тогда
		БлокОтборов = БлокОтборов + " И	 
		|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Подразделение = &ПолеВводаПодразделениеВладелец";
	ИначеЕсли Не ПодразделениеИсполнитель.Пустая() И ПодразделениеВладелец.Пустая() Тогда
		БлокОтборов = БлокОтборов + " И	 
		|  ТаблОбъектовРем.Исполнитель = &ПолеВводаПодразделениеИсполнитель";
	ИначеЕсли Не ПодразделениеВладелец.Пустая() И Не ПодразделениеИсполнитель.Пустая() Тогда
		БлокОтборов = БлокОтборов + " И	 
		|  (ТаблОбъектовРем.ОбъектРемонтныхРабот.Подразделение = &ПолеВводаПодразделениеВладелец
		|	И ТаблОбъектовРем.Исполнитель = &ПолеВводаПодразделениеИсполнитель)";
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////
	Если ОтборПоВР Тогда
		Если ОтборПоВРЗначение <> Неопределено Тогда
			
			Если ОтборПоВРВидСравнения = ВидСравнения.Равно Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот = &ПолеВводаВидРемонта";
			ИначеЕсли ОтборПоВРВидСравнения = ВидСравнения.НеРавно Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот <> &ПолеВводаВидРемонта";
			ИначеЕсли ОтборПоВРВидСравнения = ВидСравнения.ВСписке Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот В (&ПолеВводаВидРемонта)";
			ИначеЕсли ОтборПоВРВидСравнения = ВидСравнения.НеВСписке Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот НЕ В (&ПолеВводаВидРемонта)";
			ИначеЕсли ОтборПоВРВидСравнения = ВидСравнения.ВИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот В ИЕРАРХИИ (&ПолеВводаВидРемонта)";
			ИначеЕсли ОтборПоВРВидСравнения = ВидСравнения.НеВИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот НЕ В ИЕРАРХИИ (&ПолеВводаВидРемонта)";
			ИначеЕсли ОтборПоВРВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот В ИЕРАРХИИ (&ПолеВводаВидРемонта)";
			ИначеЕсли ОтборПоВРВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ВидРемонтныхРабот НЕ В ИЕРАРХИИ (&ПолеВводаВидРемонта)";
			КонецЕсли; 		
		Иначе
			БлокОтборов = БлокОтборов + " И	 
			|  ТаблОбъектовРем.ВидРемонтныхРабот = Значение(Справочник.торо_ВидыРемонтов.ПустаяСсылка)";		
		КонецЕсли;	
	КонецЕсли;
	////////////////////////////////////////////////////////////////////////////
	Если ОтборПоОрганизации Тогда
		Если ОтборПоОрганизацииЗначение <> Неопределено Тогда
			Если ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации") Тогда
				Если ОтборПоОрганизацииВидСравнения = ВидСравнения.Равно Тогда
					БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация = &ПолеВводаОрганизации";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеРавно Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация <> &ПолеВводаОрганизации";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.ВСписке Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация В (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеВСписке Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация НЕ В (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.ВИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеВИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация НЕ В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация НЕ В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					КонецЕсли;
			Иначе
				Если ОтборПоОрганизацииВидСравнения = ВидСравнения.Равно Тогда
					БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент = &ПолеВводаОрганизации";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеРавно Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент <> &ПолеВводаОрганизации";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.ВСписке Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент В (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеВСписке Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент НЕ В (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.ВИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеВИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент НЕ В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.ВСпискеПоИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					ИначеЕсли ОтборПоОрганизацииВидСравнения = ВидСравнения.НеВСпискеПоИерархии Тогда
						БлокОтборов = БлокОтборов + " И	 
						|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент НЕ В ИЕРАРХИИ (&ПолеВводаОрганизации)";
					КонецЕсли; 
				КонецЕсли;
		Иначе
			Если ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации") Тогда	
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Организация = Значение(Справочник.Организации.ПустаяСсылка)";		
			Иначе
				БлокОтборов = БлокОтборов + " И	 
				|  ТаблОбъектовРем.ОбъектРемонтныхРабот.Контрагент = Значение(Справочник.Контрагенты.ПустаяСсылка)";
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;

	БлокУпорядочиваний = "";
	Если СортироватьПоОР И НЕ ДиаграммаДляОтчета Тогда
	    БлокУпорядочиваний = БлокУпорядочиваний + "ОбъектРемонтныхРабот.Наименование";
	Иначе
	    БлокУпорядочиваний = БлокУпорядочиваний + "ВидРемонтныхРабот.Наименование";
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ПолеВводаОбъектРемонта", ОтборПоОРЗначение);
	Запрос.УстановитьПараметр("ПолеВводаПодразделениеВладелец", ПодразделениеВладелец);
	Запрос.УстановитьПараметр("ПолеВводаПодразделениеИсполнитель", ПодразделениеИсполнитель);
	Запрос.УстановитьПараметр("ПолеВводаВидРемонта",    ОтборПоВРЗначение);
	Запрос.УстановитьПараметр("ПолеВводаОрганизации",    ОтборПоОрганизацииЗначение);
	Запрос.УстановитьПараметр("СтруктураИерархии",      ИерархияОР); 
	Запрос.УстановитьПараметр("ПолеВводаДатаНачала",    ДатаНач);
	Запрос.УстановитьПараметр("ПолеВводаДатаКонца",     ДатаКон);
	Запрос.УстановитьПараметр("ПоказыватьЗамещенные",	ОтображатьЗамещенные);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&&БлокОтборов",БлокОтборов);
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&&БлокУпорядочиваний",БлокУпорядочиваний);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Если ДиаграммаДляОтчета Тогда
			
			ЭлементВыводаДиаграммы.Обновление = Ложь;
			
			Если НЕ ОтображатьИерархию Тогда
				торо_Ремонты.ПостроитьДиаграммуГантаДляППР(ЭлементВыводаДиаграммы,РезультатЗапроса.Выгрузить(),?(ОтображатьИерархию,ИерархияОР,Справочники.торо_СтруктурыОР.ПустаяСсылка()),ОтображатьИерархию,,,,Ложь,,ДиаграммаДляОтчета,СортироватьПоОР);
			Иначе
				ТаблицаКонечныхДанных = РезультатЗапроса.Выгрузить();
				ТаблицаКонечныхДанных.Индексы.Добавить("ОбъектРемонтныхРабот");
				
				ТаблицаИерархии = торо_РаботаСИерархией20.ПолучитьТаблицуИерархии(ИерархияОР);
				ТаблицаИерархии.Индексы.Добавить("ОбъектИерархии");
				
				ПустойРодитель = торо_РаботаСИерархией20.ПустойРодительПоСтруктуреИерархии(ИерархияОР);
				
				ТаблицаДанныхРодителей = Новый ТаблицаЗначений;
				ТаблицаДанныхРодителей.Колонки.Добавить("ОбъектИерархии");
				ТаблицаДанныхРодителей.Колонки.Добавить("РодительИерархии");
				ТаблицаДанныхРодителей.Колонки.Добавить("ЗначениеСортировки");
				
				ТаблицаДанныхРодителей.Индексы.Добавить("ОбъектИерархии");
				ТаблицаДанныхРодителей.Индексы.Добавить("РодительИерархии");
				
				МассивРазличныхОР = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаКонечныхДанных.ВыгрузитьКолонку("ОбъектРемонтныхРабот"));
				ДополнитьТаблицуДанныхРодителейРекурсивно(ТаблицаДанныхРодителей, ТаблицаИерархии, МассивРазличныхОР, ПустойРодитель);
				ТаблицаДанныхРодителей.Сортировать("ЗначениеСортировки");
				
				СерияРемонт = ЭлементВыводаДиаграммы.Серии.Добавить();
				СерияРемонт.Текст = "График ремонта";
				
				ВывестиИерархиюВДиаграмму(ЭлементВыводаДиаграммы, ТаблицаДанныхРодителей, ТаблицаКонечныхДанных, ПустойРодитель, СерияРемонт);
					
			КонецЕсли;
		
		Иначе
			
			РезультатТЧ = РезультатЗапроса.Выгрузить();
			
			Область = МакетОтчета.ПолучитьОбласть("Шапка");
			ЭлементВыводаДиаграммы.Вывести(Область);
			
			СписокХранения = Новый СписокЗначений;
			
			Для каждого СтрокаТаблицы из РезультатТЧ Цикл
				Если СписокХранения.НайтиПоЗначению(СтрокаТаблицы.ОбъектРемонтныхРабот) = Неопределено Тогда
					СписокХранения.Добавить(СтрокаТаблицы.ОбъектРемонтныхРабот);			
				КонецЕсли;	
			КонецЦикла;
			
			МассивОбъектов = СписокХранения.ВыгрузитьЗначения();
			
			ШиринаТаблицы = Область.ШиринаТаблицы;
			
			МассивВременныхИнтервалов = Новый Массив;
			ПериодКонРасчетный = КонецМесяца(ДатаКон);
			ТемпДата = НачалоМесяца(ДатаНач);
			ПериодовВОтчете = 0;
			СледующийМесяц = Истина;
			Пока СледующийМесяц Цикл
				Область = МакетОтчета.ПолучитьОбласть("СтолбецДня");
				ОбластьОформления = Область.Область("Знач");
				
				// >> [Деснол] [Ушаков А.Д.] [26.09.2019]
				Область.Параметры.НомИнтервала = НазваниеМесяцаСтрокой_ИменительныйПадеж(ТемпДата) + Символы.ПС + Сред(ТемпДата,7,4); 
				//Область.Параметры.НомИнтервала = НазваниеМесяцаСтрокойПадежное(Месяц(ТемпДата)) + Символы.ПС + Сред(ТемпДата, 7, 4); 
				// << [Деснол] [Ушаков А.Д.] [26.09.2019] 
				ЭлементВыводаДиаграммы.Присоединить(Область);
				
				ЕдиничныйИнтервал = Новый Структура;
				ЕдиничныйИнтервал.Вставить("НачИнт",НачалоМесяца(ТемпДата));
				ЕдиничныйИнтервал.Вставить("КонИнт",КонецМесяца(ТемпДата));	
				МассивВременныхИнтервалов.Добавить(ЕдиничныйИнтервал);

				ТемпДата = ДобавитьМесяц(ТемпДата, 1);
				Если ТемпДата > ПериодКонРасчетный Тогда
					СледующийМесяц = Ложь;		
				КонецЕсли;	
				
				ПериодовВОтчете = ПериодовВОтчете + 1;
			КонецЦикла;
			
			ШиринаТаблицы = ШиринаТаблицы + ПериодовВОтчете * Область.ШиринаТаблицы;
			
			НСТР = 1;
			Для Каждого СтрокаТЧ Из МассивОбъектов Цикл
				
				Область = МакетОтчета.ПолучитьОбласть("СтрокаЗаполнения");
				
				ФорматнаяОбласть = Область.Область("НаимПрим");
				ФорматнаяОбласть.Примечание.Текст = СтрокаТЧ.ПлановыйГрафикРаботы.Наименование;
				
				Область.Параметры.НПП = НСТР;
				Область.Параметры.НаименовОбъекта = СтрокаТЧ;
				
				ЭлементВыводаДиаграммы.Вывести(Область);
				
				Условие = Новый Структура;
				Условие.Вставить("ОбъектРемонтныхРабот", СтрокаТЧ);
				
				НайденныеСтроки = РезультатТЧ.НайтиСтроки(Условие);
				Для Сч = 1 по  МассивВременныхИнтервалов.Количество() Цикл
					
					БуфГод = "";
					ТекущийПериодНач = МассивВременныхИнтервалов[Сч - 1].НачИнт;
					ТекущийПериодКон = МассивВременныхИнтервалов[Сч - 1].КонИнт;
					
					Область = МакетОтчета.ПолучитьОбласть("ЗначенияДня");
					ОбластьФормат =  Область.Область();
					
					Для Каждого ОбъектСравнения Из НайденныеСтроки Цикл
						
						Если ОбъектСравнения.ДатаКон < ОбъектСравнения.ДатаНач Тогда
							КонечнаяДата = КонецДня(ОбъектСравнения.ДатаНач);
						Иначе
							КонечнаяДата = ОбъектСравнения.ДатаКон;
						КонецЕсли;
						
						Если  ((ТекущийПериодКон >= ОбъектСравнения.ДатаНач) И (ТекущийПериодНач <= КонечнаяДата)) Или
							((ТекущийПериодКон > ОбъектСравнения.ДатаНач) И (ТекущийПериодНач <= КонечнаяДата)) Тогда
							
							ОбластьФормат.ЦветФона = Новый Цвет(255, 251, 240);
							
							ПредставлениеВидаРемонта = торо_ЗаполнениеДокументов.ПолучитьПредоставленияВРДляПечати(ОбъектСравнения.ВидРемонтныхРабот);
							БуфГод = БуфГод + ПредставлениеВидаРемонта + ", ";			
							
							ОбластьФормат.Примечание.Текст =  ОбластьФормат.Примечание.Текст + ПредставлениеВидаРемонта +
							" (" + Лев(ОбъектСравнения.ДатаНач, 10) + " - " + Лев(ОбъектСравнения.ДатаКон, 10) + ") " + Символы.ПС;
							
						КонецЕсли;
						
					КонецЦикла;
					
					Область.Параметры.заполнение = Лев(БуфГод, СтрДлина(БуфГод) - 2);
					ЭлементВыводаДиаграммы.Присоединить(Область);
					
				КонецЦикла;
				
				НСТР = НСТР + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДиаграммаДляОтчета Тогда
		
		ЭлементВыводаДиаграммы.АвтоОпределениеПолногоИнтервала = Ложь;
	 	ЭлементВыводаДиаграммы.УстановитьПолныйИнтервал(НачалоДня(ДатаНач), КонецДня(ДатаКон));  
	 	ЭлементВыводаДиаграммы.ОтображатьЛегенду = Ложь;
		ЭлементВыводаДиаграммы.Обновление = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДополнитьТаблицуДанныхРодителейРекурсивно(ТаблицаДанныхРодителей, ТаблицаИерархии, МассивРазличныхОР, ПустойРодитель)
	
	Если МассивРазличныхОР.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивРазличныхРодителей = Новый Массив;
	
	Для каждого ОбъектРемонта из МассивРазличныхОР Цикл
		НайденнаяСтрока = ТаблицаДанныхРодителей.Найти(ОбъектРемонта, "ОбъектИерархии");
		Если НайденнаяСтрока <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаРодителя = ТаблицаИерархии.Найти(ОбъектРемонта, "ОбъектИерархии");
		Если СтрокаРодителя <> Неопределено Тогда
			РодительОР = СтрокаРодителя.РодительИерархии;
		Иначе
			РодительОР = ПустойРодитель;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РодительОР) И МассивРазличныхРодителей.Найти(РодительОР) = Неопределено Тогда
			МассивРазличныхРодителей.Добавить(РодительОР);
		КонецЕсли;
		
		НоваяСтрока = ТаблицаДанныхРодителей.Добавить();
		НоваяСтрока.ОбъектИерархии = ОбъектРемонта;
		НоваяСтрока.РодительИерархии = РодительОР;
		НоваяСтрока.ЗначениеСортировки = Строка(ОбъектРемонта);
	КонецЦикла;
	
	ДополнитьТаблицуДанныхРодителейРекурсивно(ТаблицаДанныхРодителей, ТаблицаИерархии, МассивРазличныхРодителей, ПустойРодитель);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВывестиИерархиюВДиаграмму(Диаграмма, ТаблицаДанныхРодителей, ТаблицаКонечныхДанных, ТекущийРодитель, Серия, ТочкаРодителя = Неопределено)
	
	СтрокиПодчиненных = ТаблицаДанныхРодителей.НайтиСтроки(Новый Структура("РодительИерархии", ТекущийРодитель));
	
	Для каждого Строка из СтрокиПодчиненных Цикл
		Если ТочкаРодителя = Неопределено Тогда
			НоваяТочкаОР = Диаграмма.Точки.Добавить();
		Иначе
			НоваяТочкаОР = ТочкаРодителя.Точки.Добавить();
		КонецЕсли;
		
		НоваяТочкаОР.Текст = СокрЛП(Строка.ОбъектИерархии);
		НоваяТочкаОР.Расшифровка = Строка.ОбъектИерархии;
		
		СтрокиКонечныхДанных = ТаблицаКонечныхДанных.НайтиСтроки(Новый Структура("ОбъектРемонтныхРабот", Строка.ОбъектИерархии));
		Для каждого СтрокаДанных из СтрокиКонечныхДанных Цикл
			ТочкаВР = ПолучитьТочкуВидаРемонта(НоваяТочкаОР, СтрокаДанных.ВидРемонтныхРабот);
			ДобавитьИнтервалВДиаграмму(Диаграмма, СтрокаДанных, Серия, ТочкаВР);
		КонецЦикла;
		
		ВывестиИерархиюВДиаграмму(Диаграмма, ТаблицаДанныхРодителей, ТаблицаКонечныхДанных, Строка.ОбъектИерархии, Серия, НоваяТочкаОР);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТочкуВидаРемонта(ТочкаОР, ВидРемонта)
	
	ТочкаВР = Неопределено;
	
	Для Каждого Точка1 Из ТочкаОР.Точки Цикл
		Если Точка1.Расшифровка = ВидРемонта Тогда
			ТочкаВР = Точка1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТочкаВР = Неопределено Тогда
		ТочкаВР = ТочкаОР.Точки.Добавить();
		ТочкаВР.Текст = СокрЛП(ВидРемонта);
		ТочкаВР.Расшифровка = ВидРемонта;
	КонецЕсли;
	
	Возврат ТочкаВР;
		
КонецФункции

&НаСервереБезКонтекста
Процедура ДобавитьИнтервалВДиаграмму(Диаграмма, СтрокаДанных, Серия, Точка)
	
	ТекДата = ТекущаяДата();
	
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	
	Интервал.Начало = СтрокаДанных.ДатаНач;
	Интервал.Конец  = КонецДня(?(СтрокаДанных.ДатаКон > СтрокаДанных.ДатаНач, СтрокаДанных.ДатаКон, СтрокаДанных.ДатаНач + 3600));
	Интервал.Текст  = Строка(Интервал.Начало) + " - " + Строка(Интервал.Конец);
	Интервал.Цвет = ?(СтрокаДанных.ДатаНач < ТекДата, WebЦвета.Черный, WebЦвета.Васильковый);
	
	СкопироватьИнтервалВверхПоТочкамДиаграммы(Диаграмма, Интервал, Серия, Точка.Родитель);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкопироватьИнтервалВверхПоТочкамДиаграммы(Диаграмма, КопируемыйИнтервал, Серия, Точка)
	
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	Интервал = Значение.Добавить();
	
	Интервал.Начало = КопируемыйИнтервал.Начало;
	Интервал.Конец  = КопируемыйИнтервал.Конец;
	Интервал.Текст  = КопируемыйИнтервал.Текст;
	Интервал.Цвет = КопируемыйИнтервал.Цвет;
	
	Если ТипЗнч(Точка.Родитель) = Тип("ТочкаДиаграммыГанта") Тогда
		СкопироватьИнтервалВверхПоТочкамДиаграммы(Диаграмма, КопируемыйИнтервал, Серия, Точка.Родитель);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьСписокВыбора(Список)
	
	// >> [Деснол] [Ушаков А.Д.] [04.10.2019] 
	Список.Добавить(ВидСравнения.Равно, НСтр("es='Igual';ru='Равно';en='Equally'"));   
	Список.Добавить(ВидСравнения.НеРавно, НСтр("es='No es igual';ru='Не равно';en='Not equal'"));
	Список.Добавить(ВидСравнения.ВСписке, НСтр("es='En la lista';ru='В списке';en='In the list'"));
	Список.Добавить(ВидСравнения.НеВСписке, НСтр("es='No está en la lista';ru='Не в списке';en='Not listed'")); 
	
	//Список.Добавить(ВидСравнения.Равно, "Равно");   
	//Список.Добавить(ВидСравнения.НеРавно, "Не равно");
	//Список.Добавить(ВидСравнения.ВСписке, "В списке");
	//Список.Добавить(ВидСравнения.НеВСписке, "Не в списке"); 
	// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТабличныйДокумент(ПараметрыПостроения)
	
	ТД = Новый ТабличныйДокумент;
	
	МакетОтчета = Отчеты.торо_СводнаяДиаграммаГрафиковППР.ПолучитьМакет("Макет");
	
	ЗаголовокМакета = МакетОтчета.ПолучитьОбласть("Заголовок|Параметры");
	ЗаголовокМакета.Параметры.ДатаНачала = Формат(ДатаНач, "ДФ=dd.MM.yyyy");
	ЗаголовокМакета.Параметры.ДатаОкончания = Формат(ДатаКон, "ДФ=dd.MM.yyyy");	
	ТД.Вывести(ЗаголовокМакета);
	
	Отступ = МакетОтчета.ПолучитьОбласть("Отступ");
	ТД.Вывести(Отступ);
	
	ВыводитьОтсутп = Ложь;
	
	Если ОтборПоОР И ЗначениеЗаполнено(ОтборПоОРЗначение) Тогда
		
		ОбъектРемонтаПараметр = МакетОтчета.ПолучитьОбласть("ОбъектРемонта|Параметры");
		ОбъектРемонтаПараметр.Параметры.ОбъектРемонта = ОтборПоОРЗначение;
		ОбъектРемонтаПараметр.Параметры.ВидСравнения = ОтборПоОРВидСравнения;
		ТД.Вывести(ОбъектРемонтаПараметр);
		ВыводитьОтсутп = Истина;
		
	КонецЕсли;
	
	Если ОтборПоВР И ЗначениеЗаполнено(ОтборПоВРЗначение) Тогда
		
		ВидРемонтаПараметр = МакетОтчета.ПолучитьОбласть("ВидРемонта|Параметры");
		ВидРемонтаПараметр.Параметры.ВидРемонта = ОтборПоВРЗначение;
		ВидРемонтаПараметр.Параметры.ВидСравнения = ОтборПоВРВидСравнения;
		ТД.Вывести(ВидРемонтаПараметр);
		ВыводитьОтсутп = Истина;
		
	КонецЕсли;
	
	Если ОтборПоОрганизации И ЗначениеЗаполнено(ОтборПоОрганизацииЗначение) Тогда
		
		ОрганизацияПараметр = МакетОтчета.ПолучитьОбласть("Организация|Параметры");
		Если ТипЗнч(ОрганизацияКонтрагент) = Тип("СправочникСсылка.Организации") Тогда
			ОрганизацияПараметр.Параметры.ОрганизацияКонтрагент = "Организация";
		Иначе
			ОрганизацияПараметр.Параметры.ОрганизацияКонтрагент = "Контрагент"
		КонецЕсли;
		ОрганизацияПараметр.Параметры.Организация = ОтборПоОрганизацииЗначение;
		ОрганизацияПараметр.Параметры.ВидСравнения = ОтборПоОрганизацииВидСравнения;
		ТД.Вывести(ОрганизацияПараметр);
		ВыводитьОтсутп = Истина;
		
	КонецЕсли;
	
	Если ВыводитьОтсутп Тогда
		ТД.Вывести(Отступ);
	КонецЕсли;
	
	ВыводитьОтсутп = Ложь;
	
	Если Не ПодразделениеВладелец.Пустая() Тогда
		
		ПодразделениеВладелецПараметр = МакетОтчета.ПолучитьОбласть("ПодразделениеВладелец|Параметры");
		ПодразделениеВладелецПараметр.Параметры.ПодразделениеВладелец = ПодразделениеВладелец;
		ТД.Вывести(ПодразделениеВладелецПараметр);
		ВыводитьОтсутп = Истина;
		
	КонецЕсли;
	
	Если Не ПодразделениеИсполнитель.Пустая() Тогда
		
		ПодразделениеИсполнительПараметр = МакетОтчета.ПолучитьОбласть("ПодразделениеИсполнитель|Параметры");
		ПодразделениеИсполнительПараметр.Параметры.ПодразделениеИсполнитель = ПодразделениеИсполнитель;
		ТД.Вывести(ПодразделениеИсполнительПараметр);
		ВыводитьОтсутп = Истина;
		
	КонецЕсли;
	
	Если ВыводитьОтсутп Тогда
		ТД.Вывести(Отступ);
	КонецЕсли;
	
	ВыводитьОтсутп = Ложь;
	
	Если ОтображатьИерархию Тогда
		
		ИерархияПараметр = МакетОтчета.ПолучитьОбласть("Иерархия|Параметры");
		ИерархияПараметр.Параметры.Иерархия = ИерархияОР;
		ТД.Вывести(ИерархияПараметр);
		ВыводитьОтсутп = Истина;
		
	КонецЕсли;
	
	Если ВыводитьОтсутп Тогда
		ТД.Вывести(Отступ);
	КонецЕсли;
	
	ВыводитьОтсутп = Ложь;
	
	СформироватьНаСервере(ТД, Ложь, МакетОтчета,ПараметрыПостроения);
	
	ТД.ПолеСверху = 5;
	ТД.ПолеСлева = 5;
	ТД.ПолеСправа = 5;
	ТД.ПолеСнизу = 5;
	ТД.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Возврат ТД;
	
КонецФункции

&НаСервере 
Процедура ЗаполнитьРеквизитыШапки()
	
	струкПараметров = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастрйокиТОиР", "ПараметрыОтчета_СводнаяДиаграммаГрафиковППР", Неопределено);
	Если струкПараметров <> Неопределено Тогда
		
		струкПараметров.Свойство("ОтборПоОР", ОтборПоОР);
		струкПараметров.Свойство("ОтборПоОРВидСравнения", ОтборПоОРВидСравнения);
		струкПараметров.Свойство("ОтборПоОРЗначение", ОтборПоОРЗначение);
		
		струкПараметров.Свойство("ОтборПоВР",ОтборПоВР);
		струкПараметров.Свойство("ОтборПоВРВидСравнения",ОтборПоВРВидСравнения);
		струкПараметров.Свойство("ОтборПоВРЗначение",ОтборПоВРЗначение);
		
		струкПараметров.Свойство("ОтборПоОрганизации",ОтборПоОрганизации);
		струкПараметров.Свойство("ОтборПоОрганизацииВидСравнения",ОтборПоОрганизацииВидСравнения);
		струкПараметров.Свойство("ОтборПоОрганизацииЗначение",ОтборПоОрганизацииЗначение);
		
		струкПараметров.Свойство("ОтображатьИерархию",ОтображатьИерархию);
		струкПараметров.Свойство("ИерархияОР", ИерархияОР);
		
		струкПараметров.Свойство("ПодразделениеВладелец", ПодразделениеВладелец);
		струкПараметров.Свойство("ПодразделениеИсполнитель", ПодразделениеИсполнитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВнешнимВидомФормы()
	Элементы.ОтборПоОРВидСравнения.Доступность = ОтборПоОР;
	Элементы.ОтборПоОРЗначение.Доступность = ОтборПоОР;
	
	Элементы.ОтборПоВРВидСравнения.Доступность = ОтборПоВР;
	Элементы.ОтборПоВРЗначение.Доступность = ОтборПоВР;
	
	Элементы.ОтборПоОрганизацииВидСравнения.Доступность = ОтборПоОрганизации;
	Элементы.ОтборПоОрганизацииЗначение.Доступность = ОтборПоОрганизации;
	Элементы.ОрганизацияКонтрагент.Доступность = ОтборПоОрганизации;
		
	Элементы.ИерархияОР.Доступность = ОтображатьИерархию;
КонецПроцедуры

&НаСервере 
Процедура ПриЗакрытииНаСервере()
	струкПараметров = Новый Структура(
		"ОтборПоОР, ОтборПоОРВидСравнения, ОтборПоОРЗначение, ОтборПоВР, ОтборПоВРВидСравнения, 
			|ОтборПоВРЗначение, ОтборПоОрганизации, ОтборПоОрганизацииВидСравнения, 
			|ОтборПоОрганизацииЗначение, ОтображатьИерархию, ИерархияОР, ПодразделениеВладелец, ПодразделениеИсполнитель",
		ОтборПоОР, ОтборПоОРВидСравнения, ОтборПоОРЗначение, ОтборПоВР, ОтборПоВРВидСравнения, 
			ОтборПоВРЗначение, ОтборПоОрганизации, ОтборПоОрганизацииВидСравнения, 
			ОтборПоОрганизацииЗначение, ОтображатьИерархию, ИерархияОР, ПодразделениеВладелец, ПодразделениеИсполнитель);
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("НастрйокиТОиР", "ПараметрыОтчета_СводнаяДиаграммаГрафиковППР", струкПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы Тогда
		ПриЗакрытииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

// Формирование названия месяца с учетом падежа (именительный и родительный).
//
// Параметры:
// 	НомерМесяца - номер месяца в году.
//		Падеж - указание паджа, в котором нужно сформировать название месяца
//				("Имен" - именительный, по-умолчанию; "Род" - родительный).
//
// Возвращаемое значение:
// 		Строка, название месяца с учетом падежа.
//  
&НаСервереБезКонтекста
Функция НазваниеМесяцаСтрокойПадежное(Знач НомерМесяца, Знач Падеж="Имен")
    если Падеж="Род" тогда
     если НомерМесяца=1 тогда
    	Возврат "января"
     иначеЕсли НомерМесяца=2 тогда
    	Возврат "февраля"
     иначеЕсли НомерМесяца=3 тогда
    	Возврат "марта"
     иначеЕсли НомерМесяца=4 тогда
    	Возврат "апреля"
     иначеЕсли НомерМесяца=5 тогда
    	Возврат "мая"
     иначеЕсли НомерМесяца=6 тогда
    	Возврат "июня"
     иначеЕсли НомерМесяца=7 тогда
    	Возврат "июля"
     иначеЕсли НомерМесяца=8 тогда
    	Возврат "августа"
     иначеЕсли НомерМесяца=9 тогда
    	Возврат "сентября"
     иначеЕсли НомерМесяца=10 тогда
    	Возврат "октября"
     иначеЕсли НомерМесяца=11 тогда
    	Возврат "ноября"
      иначеЕсли НомерМесяца=12 тогда
    	Возврат "декабря"
      конецЕсли;
   конецЕсли;
   если Падеж="Имен" тогда
     если НомерМесяца=1 тогда
    	Возврат "январь"
     иначеЕсли НомерМесяца=2 тогда
    	Возврат "февраль"
     иначеЕсли НомерМесяца=3 тогда
    	Возврат "март"
     иначеЕсли НомерМесяца=4 тогда
    	Возврат "апрель"
     иначеЕсли НомерМесяца=5 тогда
    	Возврат "май"
     иначеЕсли НомерМесяца=6 тогда
    	Возврат "июнь"
     иначеЕсли НомерМесяца=7 тогда
    	Возврат "июль"
     иначеЕсли НомерМесяца=8 тогда
    	Возврат "август"
     иначеЕсли НомерМесяца=9 тогда
    	Возврат "сентябрь"
     иначеЕсли НомерМесяца=10 тогда
    	Возврат "октябрь"
     иначеЕсли НомерМесяца=11 тогда
    	Возврат "ноябрь"
      иначеЕсли НомерМесяца=12 тогда
    	Возврат "декабрь"	
      конецЕсли;
   конецЕсли;
   
КонецФункции

// >> [Деснол] [Ушаков А.Д.] [26.09.2019]
Функция НазваниеМесяцаСтрокой_ИменительныйПадеж(Знач Дата)
	НазваниеМесяца = Формат(Дата, "ДФ=MMMM");
	Возврат НазваниеМесяца;
КонецФункции
// << [Деснол] [Ушаков А.Д.] [26.09.2019] 

&НаКлиенте
Процедура ОрганизацияКонтрагентПриИзменении(Элемент)
	ОтборПоОрганизацииЗначение = ОрганизацияКонтрагент;
КонецПроцедуры


#КонецОбласти
